Revit 2024 API
ViewPlan Class
 Represents floor plan, area plan, ceiling plan, and structural plan views in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ViewPlan : View
Visual Basic
Public Class ViewPlan _
	Inherits View
Visual C++
public ref class ViewPlan : public View
Remarks
 In a plan view, the model is viewed as if cut by the cut plane and viewed from above, looking down. In ceiling plan views and structural plan views which look up, the model is viewed as if cut by the cut plane, and viewed as if looking down at a mirror.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewPlan
See Also
ViewPlan Members
Autodesk.Revit.DB Namespace